app/controllers/companies_controller.rb

  def index
    redirect_to 'http://palmling.com'
    @companies = Company.all
---
SELECT "companies".* FROM "companies"