app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."permalink" IS NULL LIMIT 1
---
  def show
    @company = Company.find_by_permalink(params[:id])

INSERT INTO "companies" ("created_at", "logo", "name", "permalink", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 18 Jun 2012 08:54:51 UTC +00:00], ["logo", "ibm.png"], ["name", "IBM"], ["permalink", "ibm"], ["updated_at", Mon, 18 Jun 2012 08:54:51 UTC +00:00]]
---
  def create
    @company = Company.new(params[:company])
    if @company.save

SELECT "companies".* FROM "companies" WHERE "companies"."permalink" IS NULL LIMIT 1
---
  def register
    @user = User.new
    @company = Company.find_by_permalink(params[:id])