app/controllers/users_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."name" IS NULL LIMIT 1
---
  def new
    @user = User.new
    @company = Company.find_by_name(params[:id])