app/views/layouts/_header.html.erb

SELECT "companies".* FROM "companies" WHERE "companies"."permalink" IS NULL LIMIT 1
---
	  <%
	  	@company = Company.find_by_permalink(params[:id])